# =====================================================
# CDCR-YOLO (Coupled SMDDConv + ICARAFE)
# =====================================================

nc: 6
depth_multiple: 0.33
width_multiple: 0.50

anchors:
  - [10,13, 16,30, 33,23]
  - [30,61, 62,45, 59,119]
  - [116,90, 156,198, 373,326]




# ================= Backbone ==========================
backbone:
  # [from, number, module, args]

  [[-1, 1, Conv, [64, 6, 2, 2]],          # 0 P1/2
   [-1, 1, SMDDConv, [128, 3, 2, 4, 4, null, true, "full"]],   # 1 P2/4
   [-1, 3, C3, [128]],

   [-1, 1, SMDDConv, [256, 3, 2, 4, 4, null, true, "full"]],      # 3 P3/8
   [-1, 6, C3, [256]],                    # 4  ← P3 feature

   [-1, 1, SMDDConv, [512, 3, 2, 4, 4, null, true, "full"]],      # 5 P4/16
   [-1, 9, C3, [512]],                    # 6  ← P4 feature

   [-1, 1, SMDDConv, [1024, 3, 2, 4, 4, null, true, "full"]],     # 7 P5/32
   [-1, 3, C3, [1024]],                   # 8  ← P5 feature

   [-1, 1, SPPF, [1024, 5]],               # 9
  ]

# ================= Head ==============================
head:
  # -------- P5 -> P4 (Coupled, guidance is Down(P4) to P5 scale) --------
  [[-1, 1, Conv, [512, 1, 1]],             # 10: P5 reduce (from SPPF output)
   [6,  1, Conv, [512, 3, 2]],             # 11: P4_down -> P5 scale (s=2)
   [[-1, -2], 1, Concat, [1]],             # 12: concat(P5_reduce, P4_down) for kernel prediction guidance
   [-1, 1, Conv, [512, 1, 1]],             # 13: fuse back to 512 (keep ICARAFE input channels consistent)
   [-1, 1, ICARAFE, [512, 3, 2]],          # 14: upsample to P4 scale
   [[-1, 6], 1, Concat, [1]],              # 15: concat with original P4
   [-1, 3, C3, [512, False]],              # 16: P4 head feature

   # -------- P4 -> P3 (Coupled, guidance is Down(P3) to P4 scale) --------
   [-1, 1, Conv, [256, 1, 1]],             # 17: P4 reduce
   [4,  1, Conv, [256, 3, 2]],             # 18: P3_down -> P4 scale (s=2)
   [[-1, -2], 1, Concat, [1]],             # 19: concat(P4_reduce, P3_down) for kernel prediction guidance
   [-1, 1, Conv, [256, 1, 1]],             # 20: fuse back to 256
   [-1, 1, ICARAFE, [256, 3, 2]],          # 21: upsample to P3 scale
   [[-1, 4], 1, Concat, [1]],              # 22: concat with original P3
   [-1, 3, C3, [256, False]],              # 23: P3 head feature (small)

   # -------- Down path --------
   [-1, 1, Conv, [256, 3, 2]],             # 24: down to P4
   [[-1, 16], 1, Concat, [1]],             # 25: concat with P4 head
   [-1, 3, C3, [512, False]],              # 26: P4 head feature (medium)

   [-1, 1, Conv, [512, 3, 2]],             # 27: down to P5
   [[-1, 9], 1, Concat, [1]],              # 28: concat with SPPF(P5)
   [-1, 3, C3, [1024, False]],             # 29: P5 head feature (large)

   [[23, 26, 29], 1, Detect, [nc, anchors]] # Detect(P3, P4, P5)
  ]
